app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
  def index
    render :json => Activity.all, :include => :category, status => 200

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "travel"], ["LIMIT", 1]]
INSERT INTO "activities" ("name", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Florida"], ["category_id", 21], ["created_at", "2020-04-30 00:51:11.816487"], ["updated_at", "2020-04-30 00:51:11.816487"]]
---
  def create
    category = Category.find_by(name: params[:category].downcase)
    activity = Activity.create(name: params[:name], category: category)

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def destroy
    activity = Activity.find(params[:id])